; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v8 ?v11)
             (pred_10 ?v13 ?v7)
             (pred_4 ?v8 ?v7)
             (pred_2 ?v1 ?v8 )
	     (pred_8 ?v8)
             (pred_12 ?v12)
             (pred_9 ?v13)
             (pred_7 ?v7)
             (pred_3 ?v8)
             (pred_11 ?v13)
             (pred_6 ?v8)
             (pred_1 ))



(:action op_4
:parameters (?v3 ?v2 ?v10 ?v6)
:precondition (and (pred_12 ?v3) (pred_12 ?v2) (pred_9 ?v10) (pred_7 ?v6)
          (pred_5 ?v3 ?v2) (pred_10 ?v10 ?v6)
                   (pred_4 ?v2 ?v6) (pred_8 ?v3) 
                   (pred_3 ?v2) (pred_11 ?v10))
:effect (and  (pred_6 ?v2) (not (pred_3 ?v2))))


(:action op_1
:parameters (?v3 ?v5)
:precondition (and (pred_12 ?v3) (pred_12 ?v5)
               (pred_8 ?v3) (pred_5 ?v3 ?v5) (pred_6 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v3))))

(:action op_3
:parameters (?v3 ?v10)
:precondition (and (pred_12 ?v3) (pred_9 ?v10) 
                  (pred_8 ?v3) (pred_2 ?v10 ?v3) (pred_1 ))
:effect (and (pred_11 ?v10)
   (not (pred_2 ?v10 ?v3)) (not (pred_1 ))))


(:action op_5
:parameters (?v3 ?v4 ?v9)
:precondition (and (pred_12 ?v3) (pred_9 ?v4) (pred_9 ?v9)
                  (pred_8 ?v3) (pred_11 ?v9) (pred_2 ?v4 ?v3))
:effect (and (pred_11 ?v4) (pred_2 ?v9 ?v3)
        (not (pred_11 ?v9)) (not (pred_2 ?v4 ?v3))))

(:action op_2
:parameters (?v3 ?v10)
:precondition (and (pred_12 ?v3) (pred_9 ?v10) 
                  (pred_8 ?v3) (pred_11 ?v10))
:effect (and (pred_1 ) (pred_2 ?v10 ?v3) (not (pred_11 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_15 obj_13 obj_16 obj_05 obj_01 obj_10 obj_06 obj_17 obj_19 obj_12 obj_20 obj_02 obj_09 obj_04 obj_08 obj_18
    obj_11 obj_14
    obj_03 obj_07
    )

    (:init
       (pred_1)

       (pred_12 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_16)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_06)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_02)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_7 obj_11)
       (pred_7 obj_14)
       (pred_9 obj_03)
       (pred_9 obj_07)

       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_13)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_15)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_10 obj_12)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_13)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_06)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_10)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_08 obj_18)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_18 obj_02)
       (pred_5 obj_18 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_4  obj_04 obj_11)
       (pred_4  obj_16 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_06)
       (pred_6 obj_17)
       (pred_6 obj_19)
       (pred_6 obj_12)
       (pred_6 obj_20)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_6 obj_18)

       (pred_10  obj_03 obj_11)
       (pred_10  obj_07 obj_14)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_07 obj_19)
       (pred_8 obj_10)
    )

    (:goal (and
       (pred_2 obj_03 obj_18)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_1 obj_10 obj_13)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_03)
   deleted: (pred_2 obj_03 obj_13) (pred_1)
   added: (pred_11 obj_03)
   goals met: 0 of 1
3. (op_1 obj_13 obj_10)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_12)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_12)
   goals met: 0 of 1
5. (op_1 obj_12 obj_20)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_20)
   goals met: 0 of 1
6. (op_1 obj_20 obj_02)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_02)
   goals met: 0 of 1
7. (op_1 obj_02 obj_18)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_18)
   goals met: 0 of 1
8. (op_2 obj_18 obj_03)
   deleted: (pred_11 obj_03)
   added: (pred_1) (pred_2 obj_03 obj_18)
   goals met: 1 of 1
